cases/Chapter_5/Ito_2D/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
        type            fixedValue;
        value           $internalField;
    }

    bottom
    {
        type            fixedValue;
        value           $internalField;
    }

    right
    {
        type            fixedValue;
        value           $internalField;
    }

    left
    {
        type            fixedValue;
        value           $internalField;
    }

    cylinder
    {
        type        calculated;
        value       $internalField;
    }

}
