cases/Chapter_5/Ito_2D/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 16; // number of CPUs

method          scotch;

/*simpleCoeffs
{
    n               (16 1 1); // n1 * n2 * n3 = numberOfSubdomains
    delta           0.001; // Cell skew factor
}*/


/*hierarchicalCoeffs
{
    n               (1 1 1);
    delta           0.001;
    order           xyz;
}*/

manualCoeffs
{
    dataFile        "";
}

distributed     no;

roots           ( );

// ************************************************************************* //
